[{"id":"f7269330-e17f-11ed-a0a1-2713a7de3644","name":"The Karate Kid","details":"In China, Dre learns to defend himself against a bully under the guidance of an unassuming kung fu master in this remake of the 1984 classic.","genre":"Martial Arts Movies2","actors":"Jaden Smith, Jackie Chan, Taraji P. Henson","release_date":"2010-02-15","language":"Hindi,English"},{"id":"7b43fbf0-e2be-11ed-9908-efac81a5232c","name":"The Elephant Whisperers","details":"Bomman and Bellie, a couple in south India, devote their lives to caring for an orphaned baby elephant named Raghu, forging a family like no other.","genre":"Documentaries,Science & Nature Docs","actors":"Raghu","release_date":"2022-06-07","language":"English,Hindi,Tamil"},{"id":"bd2510e0-e2be-11ed-9100-7d0c19824fb5","name":"Swades","details":"An Americanized NASA scientist returns to his native India on a business trip and searches for the nanny who helped raise him.","genre":"Social Issue Dramas,","actors":"Shah Rukh Khan,Gayatri Joshi,Kishori Balal","release_date":"2004-05-02","language":"Hindi [Original]"},{"id":"bb7a2a90-e2bf-11ed-bbbd-e75d8c4e3667","name":"A Beautiful Mind","details":"A human drama inspired by events in the life of John Forbes Nash Jr., and in part based on the biography \"A Beautiful Mind\" by Sylvia Nasar. From the heights of notoriety to the depths of depravity, John Forbes Nash Jr. experienced it all. A mathematical genius, he made an astonishing discovery early in his career and stood on the brink of international acclaim. But the handsome and arrogant Nash soon found himself on a painful and harrowing journey of self-discovery.","genre":"Biography, Drama","actors":"Russell Crowe, Ed Harris, Jennifer Connelly, Paul Bettany","release_date":"2001-02-06","language":"English"},{"id":"ebeb9830-e2bf-11ed-a8e6-7b3c5a4947ce","name":"Kantara","details":"A fiery young man clashes with an unflinching forest officer in a south Indian village where spirituality, fate and folklore rule the lands.","genre":"Action & Adventure","actors":"Rishab Shetty,Kishore Kumar G.,Achyuth Kumar","release_date":"2022-06-07","language":"Hindi"},{"id":"87d3b430-e2c0-11ed-bc63-07256edf0a90","name":"A Walk to Remember","details":"Two North Carolina teens, Landon Carter and Jamie Sullivan, are thrown together after Landon gets into trouble and is sentenced to perform community service.","genre":"Romance, Drama","actors":"Shane West, Mandy Moore, Peter Coyote, Daryl Hannah","release_date":"2002-11-06","language":"English"}]